; domain
;; Woodworking
;;

(define (domain woodworking)
  (:requirements :typing :action-costs)
  (:types
   ;; 色、木材種別、木材、機械
   acolour awood woodobj machine 
   ;; 表面状態 ワニスなどの状態
   surface treatmentstatus
   ;; 板のサイズ規格、パーツサイズ規格
   aboardsize apartsize - object
   highspeed-saw glazer grinder immersion-varnisher
   planer saw spray-varnisher - machine
   board part - woodobj)

  (:constants
   verysmooth smooth rough - surface
   ;; ニス、光ってる、なにもされてない、色がついてる?
   varnished glazed untreated colourfragments - treatmentstatus
   ;; 色
   natural - acolour
   small medium large - apartsize)

  (:predicates
   ;; 切り出されていない。
   (unused ?obj - part)
   ;; 機械の中に入っておらず、または切り出されており、手で操作することができる。
   (available ?obj - woodobj)

   (surface-condition ?obj - woodobj ?surface - surface)
   (treatment ?obj - part ?treatment - treatmentstatus)
   (colour ?obj - part ?colour - acolour)

   ;; 木の種類。
   (wood ?obj - woodobj ?wood - awood)
   (boardsize ?board - board ?size - aboardsize)
   (goalsize ?part - part ?size - apartsize)
   (boardsize-successor ?size1 ?size2 - aboardsize)

   (in-highspeed-saw ?b - board ?m - highspeed-saw)
   (empty ?m - highspeed-saw)
   ;; 機械に装填されている塗料の色
   (has-colour ?machine - machine ?colour - acolour)
   (contains-part ?b - board ?p - part)
   ;; grindによる順序を規定
   (grind-treatment-change ?old ?new - treatmentstatus)
   (is-smooth ?surface - surface))
  
  (:functions (total-cost) - number
              (spray-varnish-cost ?obj - part) - number
              (glaze-cost ?obj - part) - number
              (grind-cost ?obj - part) - number
              (plane-cost ?obj - part) - number)

  ;; immersion: (液体に)浸すこと.
  ;; varnish : ニス，ワニス.
  ;; 浸すことによって塗装+ニス。
  ;; 大きさによってコストが変わらないみたいだ。
  (:action do-immersion-varnish
           :parameters (?x - part ?m - immersion-varnisher 
                           ?newcolour - acolour ?surface - surface)
           :precondition (and
                          (available ?x)
                          (has-colour ?m ?newcolour)
                          (surface-condition ?x ?surface)
                          (is-smooth ?surface)
                          (treatment ?x untreated))
           :effect (and
                    (increase (total-cost) 10) ;; コスト固定
                    (not (treatment ?x untreated))
                    (treatment ?x varnished)
                    (not (colour ?x natural))
                    (colour ?x ?newcolour)))

  ;; スプレーによって塗装+ニス。
  (:action do-spray-varnish
           :parameters (?x - part ?m - spray-varnisher 
                           ?newcolour - acolour ?surface - surface)
           :precondition (and
                          (available ?x)
                          (has-colour ?m ?newcolour)
                          (surface-condition ?x ?surface)
                          (is-smooth ?surface)
                          (treatment ?x untreated))
           :effect (and 
                    (increase (total-cost) (spray-varnish-cost ?x))
                    (not (treatment ?x untreated))
                    (treatment ?x varnished)
                    (not (colour ?x natural))
                    (colour ?x ?newcolour)))

  

  ;;〈紙・布・皮などに〉光滑剤を塗る，つやつけをする.
  (:action do-glaze
           :parameters (?x - part ?m - glazer 
                           ?newcolour - acolour)
           :precondition (and
                          (available ?x)
                          (has-colour ?m ?newcolour)
                          (treatment ?x untreated))
           :effect (and 
                    (increase (total-cost) (glaze-cost ?x))
                    (not (treatment ?x untreated))
                    (treatment ?x glazed)
                    (not (colour ?x natural))
                    (colour ?x ?newcolour)))

  ;; 削ってverysmoothに。塗装をやり直し。色は消える。
  (:action do-grind
           :parameters (?x - part ?m - grinder ?oldsurface - surface
                           ?oldcolour - acolour 
                           ?oldtreatment ?newtreatment - treatmentstatus) 
           :precondition (and 
                          (available ?x)
                          (surface-condition ?x ?oldsurface)
                          (is-smooth ?oldsurface)
                          (colour ?x ?oldcolour)
                          (treatment ?x ?oldtreatment)
                          (grind-treatment-change ?oldtreatment ?newtreatment))
           :effect (and
                    (increase (total-cost) (grind-cost ?x))
                    (not (surface-condition ?x ?oldsurface))
                    (surface-condition ?x verysmooth)
                    (not (treatment ?x ?oldtreatment))
                    (treatment ?x ?newtreatment)
                    (not (colour ?x ?oldcolour))
                    (colour ?x natural)))

  ;; 削ってsmoothに。
  (:action do-plane
           :parameters (?x - part ?m - planer ?oldsurface - surface
                           ?oldcolour - acolour ?oldtreatment - treatmentstatus) 
           :precondition (and 
                          (available ?x)
                          (surface-condition ?x ?oldsurface)
                          (treatment ?x ?oldtreatment)
                          (colour ?x ?oldcolour))
           :effect (and
                    (increase (total-cost) (plane-cost ?x))
                    (not (surface-condition ?x ?oldsurface))
                    (surface-condition ?x smooth)
                    (not (treatment ?x ?oldtreatment))
                    (treatment ?x untreated)
                    (not (colour ?x ?oldcolour))
                    (colour ?x natural)))

  ;; のこぎりで切る機械に入れる。
  (:action load-highspeed-saw
           :parameters (?b - board ?m - highspeed-saw)
           :precondition (and
                          (empty ?m)
                          (available ?b))
           :effect (and
                    (increase (total-cost) 30)
                    (not (available ?b))
                    (not (empty ?m))
                    (in-highspeed-saw ?b ?m)))
  
  ;; のこぎりで切る機械から取り出す。
  (:action unload-highspeed-saw
           :parameters (?b - board ?m - highspeed-saw)
           :precondition (in-highspeed-saw ?b ?m)
           :effect (and
                    (increase (total-cost) 10)
                    (available ?b)
                    (not (in-highspeed-saw ?b ?m))
                    (empty ?m)))
  
  ;; のこぎり機械に入っている場合、小さく切る。
  ;; do-saw-small と違って、時間は10しかかからない。
  ;; 
  (:action cut-board-small
           :parameters (?b - board ?p - part ?m - highspeed-saw ?w - awood
                           ?surface - surface ?size_before ?size_after - aboardsize)
           :precondition (and
                          (unused ?p)
                          (goalsize ?p small)
                          (in-highspeed-saw ?b ?m)
                          (wood ?b ?w)
                          (surface-condition ?b ?surface)
                          (boardsize ?b ?size_before)
                          (boardsize-successor ?size_after ?size_before))
           :effect (and
                    (increase (total-cost) 10)
                    (not (unused ?p))
                    (available ?p)
                    (wood ?p ?w)
                    (surface-condition ?p ?surface)
                    (colour ?p natural)
                    (treatment ?p untreated)
                    (boardsize ?b ?size_after)))

  ;; 中くらいに切る。
  (:action cut-board-medium
           :parameters (?b - board ?p - part ?m - highspeed-saw ?w - awood
                           ?surface - surface 
                           ?size_before ?s1 ?size_after - aboardsize)
           :precondition (and
                          (unused ?p)
                          (goalsize ?p medium)
                          (in-highspeed-saw ?b ?m)
                          (wood ?b ?w)
                          (surface-condition ?b ?surface)
                          (boardsize ?b ?size_before)
                          (boardsize-successor ?size_after ?s1)
                          (boardsize-successor ?s1 ?size_before))
           :effect (and
                    (increase (total-cost) 10)
                    (not (unused ?p))
                    (available ?p)
                    (wood ?p ?w)
                    (surface-condition ?p ?surface)
                    (colour ?p natural)
                    (treatment ?p untreated)
                    (boardsize ?b ?size_after)))

  (:action cut-board-large
           :parameters (?b - board ?p - part ?m - highspeed-saw ?w - awood
                           ?surface - surface 
                           ?size_before ?s1 ?s2 ?size_after - aboardsize)
           :precondition (and
                          (unused ?p)
                          (goalsize ?p large)
                          (in-highspeed-saw ?b ?m)
                          (wood ?b ?w)
                          (surface-condition ?b ?surface)
                          (boardsize ?b ?size_before)
                          (boardsize-successor ?size_after ?s1)
                          (boardsize-successor ?s1 ?s2)
                          (boardsize-successor ?s2 ?size_before))
           :effect (and
                    (increase (total-cost) 10)
                    (not (unused ?p))
                    (available ?p)
                    (wood ?p ?w)
                    (surface-condition ?p ?surface)
                    (colour ?p natural)
                    (treatment ?p untreated)
                    (boardsize ?b ?size_after)))

  ;; 手で板を切り出す。板が大きかろうが小さかろうが30かかる
  ;; 板の大きさは小さくなる。(size_after になる)
  ;; ここらへんは do-saw-small/medium/large全部同じ。
  ;; largeを切りだそうとすると板が3段階小さくなる。
  (:action do-saw-small
           :parameters (?b - board ?p - part ?m - saw ?w - awood
                           ?surface - surface ?size_before ?size_after - aboardsize) 
           :precondition (and 
                          (unused ?p)
                          (goalsize ?p small)
                          (available ?b)
                          (wood ?b ?w)
                          (surface-condition ?b ?surface)
                          (boardsize ?b ?size_before)
                          (boardsize-successor ?size_after ?size_before))
           :effect (and
                    (increase (total-cost) 30)
                    (not (unused ?p))
                    (available ?p)
                    (wood ?p ?w)
                    (surface-condition ?p ?surface)
                    (colour ?p natural) 
                    (treatment ?p untreated)
                    (boardsize ?b ?size_after)))

  (:action do-saw-medium
           :parameters (?b - board ?p - part ?m - saw ?w - awood
                           ?surface - surface 
                           ?size_before ?s1 ?size_after - aboardsize) 
           :precondition (and 
                          (unused ?p)
                          (goalsize ?p medium)
                          (available ?b)
                          (wood ?b ?w)
                          (surface-condition ?b ?surface)
                          (boardsize ?b ?size_before)
                          (boardsize-successor ?size_after ?s1)
                          (boardsize-successor ?s1 ?size_before))
           :effect (and
                    (increase (total-cost) 30)
                    (not (unused ?p))
                    (available ?p)
                    (wood ?p ?w)
                    (surface-condition ?p ?surface)
                    (colour ?p natural) 
                    (treatment ?p untreated)
                    (boardsize ?b ?size_after)))

  (:action do-saw-large
           :parameters (?b - board ?p - part ?m - saw ?w - awood
                           ?surface - surface 
                           ?size_before ?s1 ?s2 ?size_after - aboardsize) 
           :precondition (and 
                          (unused ?p)
                          (goalsize ?p large)
                          (available ?b)
                          (wood ?b ?w)
                          (surface-condition ?b ?surface)
                          (boardsize ?b ?size_before)
                          (boardsize-successor ?size_after ?s1)
                          (boardsize-successor ?s1 ?s2)
                          (boardsize-successor ?s2 ?size_before))
           :effect (and
                    (increase (total-cost) 30)
                    (not (unused ?p))
                    (available ?p)
                    (wood ?p ?w)
                    (surface-condition ?p ?surface)
                    (colour ?p natural) 
                    (treatment ?p untreated)
                    (boardsize ?b ?size_after)))
  )

; problem
; woodworking task with 3 parts and 120% wood
; Machines:
;   1 grinder
;   1 glazer
;   1 immersion-varnisher
;   1 planer
;   1 highspeed-saw
;   1 spray-varnisher
;   1 saw
; random seed: 578239

(define (problem wood-prob-sat-10)
  (:domain woodworking)
  (:objects
    grinder0 - grinder
    glazer0 - glazer
    immersion-varnisher0 - immersion-varnisher
    planer0 - planer
    highspeed-saw0 - highspeed-saw
    spray-varnisher0 - spray-varnisher
    saw0 - saw
    blue mauve - acolour
    beech mahogany - awood
    p0 p1 p2 - part
     - board
    s0 - aboardsize
  )
  (:init
    (grind-treatment-change varnished colourfragments)
    (grind-treatment-change glazed untreated)
    (grind-treatment-change untreated untreated)
    (grind-treatment-change colourfragments untreated)
    (is-smooth smooth)
    (is-smooth verysmooth)
    (= (total-cost) 0)
    (has-colour glazer0 natural)
    (has-colour immersion-varnisher0 blue)
    (empty highspeed-saw0)
    (has-colour spray-varnisher0 mauve)
    (available p0)
    (colour p0 blue)
    (wood p0 mahogany)
    (surface-condition p0 verysmooth)
    (treatment p0 colourfragments)
    (goalsize p0 small)
    (= (spray-varnish-cost p0) 5)
    (= (glaze-cost p0) 10)
    (= (grind-cost p0) 15)
    (= (plane-cost p0) 10)
    (available p1)
    (colour p1 natural)
    (wood p1 mahogany)
    (surface-condition p1 smooth)
    (treatment p1 colourfragments)
    (goalsize p1 small)
    (= (spray-varnish-cost p1) 5)
    (= (glaze-cost p1) 10)
    (= (grind-cost p1) 15)
    (= (plane-cost p1) 10)
    (available p2)
    (colour p2 mauve)
    (wood p2 beech)
    (surface-condition p2 verysmooth)
    (treatment p2 colourfragments)
    (goalsize p2 small)
    (= (spray-varnish-cost p2) 5)
    (= (glaze-cost p2) 10)
    (= (grind-cost p2) 15)
    (= (plane-cost p2) 10)
  )
  (:goal
    (and
      (available p0)
      (wood p0 mahogany)
      (surface-condition p0 smooth)
      (available p1)
      (surface-condition p1 smooth)
      (treatment p1 glazed)
      (available p2)
      (colour p2 natural)
      (treatment p2 glazed)
    )
  )
  (:metric minimize (total-cost))
)

; plan
1. (do-plane p2 planer0 verysmooth mauve colourfragments)
   deleted: (surface-condition p2 verysmooth) (treatment p2 colourfragments) (colour p2 mauve)
   added: (surface-condition p2 smooth) (treatment p2 untreated) (colour p2 natural)
   goals met: 6 of 9
2. (do-glaze p2 glazer0 natural)
   deleted: (treatment p2 untreated)
   added: (treatment p2 glazed)
   goals met: 7 of 9
3. (do-plane p1 planer0 smooth natural colourfragments)
   deleted: (treatment p1 colourfragments)
   added: (treatment p1 untreated)
   goals met: 7 of 9
4. (do-glaze p1 glazer0 natural)
   deleted: (treatment p1 untreated)
   added: (treatment p1 glazed)
   goals met: 8 of 9
5. (do-plane p0 planer0 verysmooth blue colourfragments)
   deleted: (surface-condition p0 verysmooth) (treatment p0 colourfragments) (colour p0 blue)
   added: (surface-condition p0 smooth) (treatment p0 untreated) (colour p0 natural)
   goals met: 9 of 9
